## Final Project

In this project I am examining income of ivy league and public/private college graduates and regressing different to find what leads to the largest correlation. Do graduates from ivy league colleges receive more incomes than graduates of other colleges. Does it impact one’s income at all? Does ivy league’s education help graduates receive more income or is it dependent on one’s major? Do ivy league graduates receive more incomes than others in first place? After that I will discover ivy league institution is profitable over public/private colleges.

The observations are: school name, school type, early career pay, mid-career pay, and % STEM degrees. The attribute for school name are 'str,' for school type are 'str,' for early career pay are 'float,' for mid-career pay are 'float,' and for % STEM degrees are 'float.' This dataset was created to effectively compare Ivy league school benefits over other private/public schools

The public and private school dataset only includes top 100 schools with high career pay. Thus, the gap between Ivy league school and schools in the dataset might not be too big.


Data is from: payscale.com


The raw data is at: https://github.com/yskim2015/2950_final.git

In [15]:
import pandas, numpy
from matplotlib import pyplot  as plt
import scipy.stats
from sklearn.linear_model import LinearRegression
import sqlite3

In [11]:
pp= pandas.read_csv("publicprivate.csv")
pp.head()

,School Name,School Type,Early Career Pay,Mid-Career Pay,% STEM Degrees
0,Harvey Mudd College,"Engineering, Liberal Arts School, Private School","88,800.00","158,200.00",0.85
1,Massachusetts Institute of Technology,"Engineering, Private School, Research University","86,300.00","155,200.00",0.69
2,Samuel Merritt University,Private School,"91,200.00","154,100.00",0.00
3,United States Naval Academy,"Engineering, Liberal Arts School, Sober School...","80,100.00","152,800.00",0.58
4,California Institute of Technology,"Engineering, Private School, Research University","84,100.00","151,600.00",0.97

In [8]:
ivy= pandas.read_csv("ivy.csv")
ivy.head()

,School Name,School Type,Early Career Pay,Mid-Career Pay,% STEM Degrees
0,Harvard University,Ivy League,"74,800.00","146,800.00",0.19
1,Princeton University,Ivy League,"75,200.00","139,400.00",0.48
2,Yale University,Ivy League,"70,300.00","138,300.00",0.22
3,University of Pennsylvania,Ivy League,"72,800.00","133,900.00",0.21
4,Dartmouth College,Ivy League,"71,500.00","130,900.00",0.35